/*
	2023-04-05 21:49:45
	回文数判断
*/
# include <stdio.h>

int main(void)
{
	int m, val;		//val 存放待判断的数字
	int sum = 0;

	printf("请输入您需要判断的数字：");
	scanf("%d", &val);

	m =val;
	while (m)
	{
		sum = sum * 10 + m%10;
		m /= 10;
	}

	if (sum == val)
		printf("YES!\n");
	else
		printf("NO!\n");

	return 0;
}
/*
试数：1234
------------------------
1->	m=1234 成立
	sum=10*0+1234%10 =4
	m=m/10=1234/10 = 123
2-> m=123 成立
	sum=10*4+123%10 = 43
	m=m/10=123/10 = 12
3-> m=12 成立
	sum=43*10+12%10 = 432
	m=m/10=12/10 = 1
4-> m=1 成立
	sum=432*10+1%10 = 4321
	m=m/10 =1/10 = 0
5-> m=0 不成立

最终sum = 4321
------------------------
*/